---
kind: property
id: P:Autodesk.Revit.DB.Structure.LoadBase.LoadCaseName
source: html/9bf650db-2f9c-08c3-ad05-33ce349b9134.htm
---
# Autodesk.Revit.DB.Structure.LoadBase.LoadCaseName Property

The name of the load case to which this load belongs.

## Syntax (C#)
```csharp
public string LoadCaseName { get; }
```